/*Conditions:
 * Напишите программу вычисления суммы четырёх слагаемых
 */
public class task5 {

	public static void main(String[] args) {
		System.out.println(4+5+2+1);
	}

}
