/*Условие:
 * Выведите на консоль ваши ФИО, адрес и телефон
 */

public class task2 {

	public static void main(String[] args) {
		System.out.println("Гуржий Алексей Александрович");
		System.out.println("РБ г. Минск");
		System.out.println("+375-11-11-11-11-1");
	}

}
